diagram update
